public class ToyProblemWelcome {
    public static void Welcome() {
        System.out.println();
         String blockArt = 
            "████████╗ ██████╗ ██╗   ██╗    ██████╗ ██████╗  ██████╗ ██████╗ ██╗     ███████╗███╗   ███╗\n" +
            "╚══██╔══╝██╔═══██╗╚██╗ ██╔╝    ██╔══██╗██╔══██╗██╔═══██╗██╔══██╗██║     ██╔════╝████╗ ████║\n" +
            "   ██║   ██║   ██║ ╚████╔╝     ██████╔╝██████╔╝██║   ██║██████╔╝██║     █████╗  ██╔████╔██║\n" +
            "   ██║   ██║   ██║  ╚██╔╝      ██╔═══╝ ██╔══██╗██║   ██║██╔══██╗██║     ██╔══╝  ██║╚██╔╝██║\n" +
            "   ██║   ╚██████╔╝   ██║       ██║     ██║  ██║╚██████╔╝██████╔╝███████╗███████╗██║ ╚═╝ ██║\n" +
            "   ╚═╝    ╚═════╝    ╚═╝       ╚═╝     ╚═╝  ╚═╝ ╚═════╝ ╚═════╝ ╚══════╝╚══════╝╚═╝     ╚═╝";

        System.out.println(blockArt);
        
        System.out.println("\n      [!] TOY PROBLEM MODULE LOADED: Ready for Logic Execution...");
        System.out.println("      [!] Use this module to test and debug your toy problem implementations.\n");
        
    }
}